common/components/AdminLog.php


        $model = new \app\models\AdminLog();
        $model->setAttributes($data);
        if ($model->save()){
---
INSERT INTO `pre_admin_log` (`route`, `table_name`, `operation_type`, `description`, `created_at`, `user_id`) VALUES ('/activity/advert/update.html?id=4', '{{%activity_advert}}', 'update', 'alex修改了 id=4 的 position 为 2  [ 原始数据: 1 ],updated_at 为 1505149843  [ 原始数据: 1505033591 ]', 1505149843, 3)