common/models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `pre_user` WHERE (`id`=3) AND (`status`=10)