backend/modules/admin/components/FriendHelper.php

SELECT `user`.`id`, `user`.`username`, count(message.id) as message_num FROM `pre_user` `user` LEFT JOIN `pre_message` `message` ON message.from_user_id=user.id WHERE (`user`.`id` != 3) AND (`message`.`to_user_id`=3) GROUP BY `user`.`id`
---
    public static function getAssignedFriendList($user_id)
    {
        $result = UserModel::find()
            ->select('user.id,user.username,count(message.id) as message_num')
            ->from(['user'=>UserModel::tableName()])
            ->leftJoin(['message'=>MessageSearch::tableName()],'message.from_user_id=user.id')
            ->where(['!=','user.id',$user_id])
            ->andwhere(['message.to_user_id'=>$user_id])
            ->groupBy(['user.id'])
            ->asArray()
            ->all();