backend/modules/admin/controllers/UserController.php

SELECT * FROM `pre_user` WHERE `id`='6'
---
    protected function findModel($id) {
        if (($model = User::findOne($id)) !== null) {