backend/modules/activity/controllers/AdvertController.php

INSERT INTO `pre_activity_advert` (`advert_title`, `type`, `link_url`, `activity_id`, `target`, `status`, `position`, `file_url`, `user_id`, `created_at`, `updated_at`) VALUES ('首页广告', 1, '', 2, 1, 2, 1, 'http://advert.ztwliot.com/QB1505149920', 3, 1505149933, 1505149933)
---
    public function actionCreate()
    {

        $activityList = ActivityBaseSearch::find()->select('id,title')->all();
        $model = new ActivityAdvert();

        $p1 = $p2 = '';

        if ($model->load(Yii::$app->request->post())) {
            if ($model->file_url=='')
            {
                throw new \HttpInvalidParamException('文件未上传');
            }
            $model->user_id    = yii::$app->user->identity->getId();
            $model->created_at = time();
            $model->updated_at = time();
            if ($model->save()){

SELECT * FROM `pre_activity_advert` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = ActivityAdvert::findOne($id)) !== null) {