backend/modules/activity/controllers/DefaultController.php

    protected function findModel($id)
    {
        if (($model = ActivityBase::findOne($id)) !== null) {
---
SELECT * FROM `pre_activity_base` WHERE `id`='2'