backend/models/ActivityAdvertSearch.php

    public static function getOne($id)
    {
        $query = ActivityAdvertSearch::find();
        $query->select('aa.*,ab.title');
        $query->from(['aa' => ActivityAdvert::tableName()]);
        $query->leftJoin(['ab' => ActivityBase::tableName()], 'aa.activity_id=ab.id');
        $query->where(['aa.id'=>$id]);
        return $query->one();
---
SELECT `aa`.*, `ab`.`title` FROM `pre_activity_advert` `aa` LEFT JOIN `pre_activity_base` `ab` ON aa.activity_id=ab.id