frontend/models/ApplyUserService.php

SELECT `ar`.`id`, `ar`.`apply_name`, `ar`.`self_desc`, `ar`.`self_picture`, `ar`.`self_media`, `raa`.`votes` FROM `pre_apply_record` `ar` LEFT JOIN `pre_activity_base` `ab` ON ar.activity_id=ab.id LEFT JOIN `pre_relate_activity_apply` `raa` ON raa.apply_id=ar.id WHERE ar.status=2 ORDER BY `raa`.`votes` DESC LIMIT 10
---
    public function getUserApplyList($pageSize=10)
    {
        $query = self::find();
        $query->select('ar.id,ar.apply_name,ar.self_desc,ar.self_picture,ar.self_media,raa.votes');
        $query->from(['ar'=>ApplyRecord::tableName()]);
        $query->leftJoin(['ab'=>ActivityBase::tableName()],'ar.activity_id=ab.id');
        $query->leftJoin(['raa'=>RelateActivityApply::tableName()],'raa.apply_id=ar.id');
        $query->where('ar.status=2');
        $query->orderBy(['raa.votes'=>SORT_DESC]);

        $curr_page   = Yii::$app->request->get('page') ? Yii::$app->request->get('page') : 1;

        return $query->offset(($curr_page-1)*$pageSize)
            ->limit($pageSize)
            ->asArray()
            ->all();

SELECT `aa`.* FROM (SELECT * FROM `pre_activity_advert`) `aa` LEFT JOIN `pre_activity_base` `ab` ON aa.activity_id=ab.id WHERE (`aa`.`status`=2) AND (`aa`.`type`=1) AND (`aa`.`position`=1)
---
    public static function getAdvertList($postion=1)
    {
        $query = ActivityAdvert::find();
        $query->select('aa.*');
        $query->from(['aa'=>ActivityAdvert::find()]);
        $query->leftJoin(['ab'=>ActivityBase::tableName()],'aa.activity_id=ab.id');
        $query->where(['aa.status'=>2]);
        if ($postion==1){
            $query->andWhere(['aa.type'=>1]);
            $query->andWhere(['aa.position'=>1]);
        }else{
            $query->andWhere(['aa.type'=>2]);
            $query->andWhere(['aa.position'=>2]);
        }
        return $query->asArray()->all();

SELECT `ar`.`id`, `ar`.`apply_name`, `ar`.`self_desc`, `ar`.`self_picture`, `ar`.`self_media`, `raa`.`votes` FROM `pre_apply_record` `ar` LEFT JOIN `pre_activity_base` `ab` ON ar.activity_id=ab.id LEFT JOIN `pre_relate_activity_apply` `raa` ON raa.apply_id=ar.id WHERE ar.status=2 ORDER BY `raa`.`votes` DESC, `ar`.`created_at` LIMIT 3
SELECT COUNT(*) FROM `pre_apply_record` `ar` LEFT JOIN `pre_activity_base` `ab` ON ar.activity_id=ab.id LEFT JOIN `pre_relate_activity_apply` `raa` ON raa.apply_id=ar.id WHERE ar.status=2
SELECT sum(raa.votes) as count_votes FROM `pre_relate_activity_apply` `raa` LEFT JOIN `pre_apply_record` `ar` ON raa.apply_id=ar.id LEFT JOIN `pre_activity_base` `ab` ON ar.activity_id=ab.id WHERE ar.status=2
---
    public static function getActivityInfo()
    {
        $query = self::find();
        $tempQuery = clone $query;
        $tmpQuery  = clone $query;
        $query->select('ar.id,ar.apply_name,ar.self_desc,ar.self_picture,ar.self_media,raa.votes');
        $query->from(['ar'=>ApplyRecord::tableName()]);
        $query->leftJoin(['ab'=>ActivityBase::tableName()],'ar.activity_id=ab.id');
        $query->leftJoin(['raa'=>RelateActivityApply::tableName()],'raa.apply_id=ar.id');
        $query->where('ar.status=2');
        $query->orderBy(['raa.votes'=>SORT_DESC,'ar.created_at'=>SORT_ASC]);
        $query->limit(3);
        $result['TopThree'] = $query->asArray()->all();

        $tempQuery->select('ar.id');
        $tempQuery->from(['ar'=>ApplyRecord::tableName()]);
        $tempQuery->leftJoin(['ab'=>ActivityBase::tableName()],'ar.activity_id=ab.id');
        $tempQuery->leftJoin(['raa'=>RelateActivityApply::tableName()],'raa.apply_id=ar.id');
        $tempQuery->where('ar.status=2');
        $result['countApply'] = $tempQuery->count();

        $tmpQuery->select('sum(raa.votes) as count_votes');
        $tmpQuery->from(['raa'=>RelateActivityApply::tableName()]);
        $tmpQuery->leftJoin(['ar'=>ApplyRecord::tableName()],'raa.apply_id=ar.id');
        $tmpQuery->leftJoin(['ab'=>ActivityBase::tableName()],'ar.activity_id=ab.id');
        $tmpQuery->where('ar.status=2');

        $result['countVotes'] = $tmpQuery->asArray()->one();